Revit 2018 API
AssetProperty Members
The AssetProperty type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the AssetProperty
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetAllConnectedProperties
 Gets the list of the connected properties. Connected properties are the detachable properties of an AssetProperty. e.g. diffuse property can have texture as its connected property. It can also detach texture on runtime.
GetConnectedPropertiesNames
 Gets names of all connected properties.
GetConnectedProperty(Int32)
 Gets one connected property with specified index.
GetConnectedProperty(String)
 Gets a connected property by its name.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetTypeName
Get the name of the AssetProperty
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsReadOnly
 Identifies if the object is read-only or modifiable. If true, the object may not be modified. If false, the object's contents may be modified.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Name
Get the name of the AssetProperty
NumberOfConnectedProperties
 The number of currently connected properties.
Type
Returns the type of the AssetProperty
See Also
AssetProperty Class
Autodesk.Revit.DB.Visual Namespace